aaron-bond.better-comments
alefragnani.project-manager
amazonwebservices.codewhisperer-for-command-line-companion
atommaterial.a-file-icon-vscode
be5invis.vscode-custom-css
cardinal90.multi-cursor-case-preserve
charliermarsh.ruff
eamodio.gitlens
equinusocio.vsc-material-theme
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
humao.rest-client
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
openai.chatgpt
pkief.material-icon-theme
reditorsupport.r
reditorsupport.r-syntax
ritwickdey.liveserver
streetsidesoftware.code-spell-checker
subframe7536.custom-ui-style
tal7aouy.icons
tomoki1207.pdf
vscode-icons-team.vscode-icons
wix.vscode-import-cost
yzhang.markdown-all-in-one
